In [1]:
import sqlite3
import pandas as pd
import psycopg2

Упражнения SQL

In [2]:
conn = sqlite3.connect('products.db')

cursor = conn.cursor()

In [3]:
cursor.execute("""CREATE TABLE IF NOT EXISTS products (
                    id INT PRIMARY KEY,
                    name VARCHAR(255),
                    price INT,
                    category VARCHAR(255))""")

In [ ]:
cursor.execute("INSERT INTO products VALUES (1, 'Банан', 50, 'Фрукты'),\
                                            (2, 'Кефир', 70, 'Кисло-молочное'), \
                                            (3, 'Творог', 120, 'Кисло-молочное'), \
                                            (4, 'Макароны', 50, 'Гарниры'),\
                                            (5, 'Молоко', 75, 'Кисло-молочное'),\
                                            (6, 'Гречка', 40, 'Гарниры')")
conn.commit()

 Упражнения SQLite

In [4]:
data = pd.read_sql_query("SELECT * FROM products", conn)
data

   id      name  price        category  discount  revenue
0   1     Банан     50          Фрукты      0.15    42.50
1   2     Кефир     70  Кисло-молочное      0.15    59.50
2   3    Творог    120  Кисло-молочное      0.15   102.00
3   4  Макароны     50         Гарниры      0.15    42.50
4   5    Молоко     75  Кисло-молочное      0.15    63.75
5   6    Гречка     40         Гарниры      0.15    34.00

In [5]:
filtered = data[data['price'] > 50]
filtered

   id    name  price        category  discount  revenue
1   2   Кефир     70  Кисло-молочное      0.15    59.50
2   3  Творог    120  Кисло-молочное      0.15   102.00
4   5  Молоко     75  Кисло-молочное      0.15    63.75

In [6]:
data['discount'] = 0.15

In [7]:
data['revenue'] = data['price'] - (data['price'] * data['discount'])

In [8]:
data

   id      name  price        category  discount  revenue
0   1     Банан     50          Фрукты      0.15    42.50
1   2     Кефир     70  Кисло-молочное      0.15    59.50
2   3    Творог    120  Кисло-молочное      0.15   102.00
3   4  Макароны     50         Гарниры      0.15    42.50
4   5    Молоко     75  Кисло-молочное      0.15    63.75
5   6    Гречка     40         Гарниры      0.15    34.00

In [9]:
data.to_sql("products", conn, if_exists="replace",index=False)

6

In [10]:
cursor.execute("SELECT * FROM products")
for row in cursor.fetchall():
    print(row)

(1, 'Банан', 50, 'Фрукты', 0.15, 42.5)
(2, 'Кефир', 70, 'Кисло-молочное', 0.15, 59.5)
(3, 'Творог', 120, 'Кисло-молочное', 0.15, 102.0)
(4, 'Макароны', 50, 'Гарниры', 0.15, 42.5)
(5, 'Молоко', 75, 'Кисло-молочное', 0.15, 63.75)
(6, 'Гречка', 40, 'Гарниры', 0.15, 34.0)

 Упражнения PostgreSQL

In [ ]:
pip install psycopg2

In [ ]:
pip install PostgreSQL

In [28]:
conn_params = {
    'host': '172.17.1.49',
    'port': 5432,
    'database': 'module1',
    'user': 'da',
    'password': 'da2024DE@'
}

In [29]:
conn = psycopg2.connect(**conn_params)

In [30]:
cursor = conn.cursor()

In [31]:
cursor.execute('''CREATE TABLE IF NOT EXISTS users123 (
                    id INTEGER PRIMARY KEY,
                    username VARCHAR(255),
                    email VARCHAR(255),
                    passwords VARCHAR(255))''')

In [32]:
cursor.execute("INSERT INTO users123 VALUES (1, 'user1', 'user1@gmail.com', 'qwe123'),\
                                         (2, 'user2', 'user2@mail.ru', 'qwer1234'), \
                                         (3, 'user3', 'user3@yandex.ru', 'ewq321')")

conn.commit()

Упражнения DML

In [33]:
cursor.execute("SELECT * FROM users123 WHERE email = 'user1@gmail.com'")

for row in cursor.fetchall():
    print(row)

(1, 'user1', 'user1@gmail.com', 'qwe123')

In [34]:
cursor.execute("UPDATE users123 SET passwords = 'pass' WHERE id = 3")

In [36]:
cursor.execute("SELECT * FROM users123")
for row in cursor.fetchall():
    print(row)

(1, 'user1', 'user1@gmail.com', 'qwe123')
(2, 'user2', 'user2@mail.ru', 'qwer1234')
(3, 'user3', 'user3@yandex.ru', 'pass')

In [37]:
cursor.execute("DELETE FROM users123 WHERE username = 'user2'")

In [38]:
cursor.execute("SELECT * FROM users123")
for row in cursor.fetchall():
    print(row)

(1, 'user1', 'user1@gmail.com', 'qwe123')
(3, 'user3', 'user3@yandex.ru', 'pass')

In [39]:
cursor.close()
conn.close()

Упражнения - Интеграция с Pandas

In [41]:
conn = sqlite3.connect('products.db')
cursor = conn.cursor()

In [42]:
df = pd.read_sql_query("SELECT * FROM products", conn)

In [44]:
df = pd.DataFrame(df)

   id      name  price        category  discount  revenue
0   1     Банан     50          Фрукты      0.15    42.50
1   2     Кефир     70  Кисло-молочное      0.15    59.50
2   3    Творог    120  Кисло-молочное      0.15   102.00
3   4  Макароны     50         Гарниры      0.15    42.50
4   5    Молоко     75  Кисло-молочное      0.15    63.75
5   6    Гречка     40         Гарниры      0.15    34.00

In [45]:
df = df[df['price'] > 50]

In [46]:
df.to_sql("products", conn, if_exists="replace",index=False)

3

In [47]:
cursor.execute("SELECT * FROM products")
for row in cursor.fetchall():
    print(row)

(2, 'Кефир', 70, 'Кисло-молочное', 0.15, 59.5)
(3, 'Творог', 120, 'Кисло-молочное', 0.15, 102.0)
(5, 'Молоко', 75, 'Кисло-молочное', 0.15, 63.75)